// 1
'number' + 3 + 3   =>   'number33'
/* 'number' + 3 => concatenation => 'number3'
   'number3' + 3 => concatenation => 'number33' */

// 2
null + 3  =>  3
/* null при математичних операціях перетворюється на 0 */

// 3
5 && "qwerty"  =>  'qwerty'
/* Оператор && повертає або перше неправдиве значення, або якщо всі правдиві, то останнє правдиве
   У прикладі 5 та qwerty правдиві, тому повертається рядок qwerty */ 

// 4
+'40' + +'2' + "hillel"  =>  '42hillel'
/* + перед '40' перетворює його в число, те саме з + +'2' => 40 + 2 = 42
   42 + 'hillel' => concatenation => '42hillel' */


// 5
'10' - 5 === 6  =>  false
/* це строге порівняння, яке каже що права і ліва частина від === мають бути рівні. 
   При відніманні '10' йде як число, виходить твердження що 10 - 5 = 6. Так як рівність не правдива, результат false */

// 6
true + false  => 1
/* true це 1, fasle це 0, 1 + 0 = 1 */

// 7
'4px' - 3   => NaN
/* При віднімання '4px' не можна перетворити в число, воно стає NaN
   NaN - 3 = NaN */

// 8
'4' - 3  =>  1
/* '4' при відніманні стає числом, тому 4 - 3 = 1 */

// 9
'6' + 3 ** 0  =>  '61'
/* 3 підносимо до степеню 0 => 1
   '6' + 1 => concatenation => '61' */

// 10
12 / '6'  =>  2
/* Ділення приводить рядок '6' до числа 6 => 12 / 6 = 2 */

// 11
'10' + (5 === 6)  =>  '10false'
/* Перша дія в дужках - строге порівняння що 5 = 6 - неправдиве => false
   Рядок '10' + boolean = concatenation => '10false' */

// 12
null == ''  => undefined
/* нестроге порівняння приводить до одного типу, null цк відсутність значення aka undefined
  '' це пустий рядок aka 0. Відповідно твердження що undefined == 0 => false*/

// 13
3 ** (9 / 3)  => 27
/* Спочатку в дужках дія ділення 9 / 3 = 3
   Далі підносимо 3 до степеню 3 => 3 * 3 * 3 = 27 */

// 14
!!'false' == !!'true'  =>  true
/* !! приводить будь яку значення в boolean. Будь який непорожній рядок буде true. 
   Рівність стає true == true і є вірною => true*/

// 15
0 || '0' && 1  => 1
/* && має перший пріоритет і повертає перше false, або за відсутності такого - останнє true значення, тобто 1
   || має другий пріоритет і повертає перше true значення, або за відсутності такого - останнє false, тобто 1 */

// 16
(+null == false) < 1  =>  false
/* +null => 0; 0 == false => true; true => 1; 1 < 1 => false */

// 17
false && true || true  =>  true
/* && повертає перше false, або за відсутності такого - останнє true значення, тобто false
   || повертає перше true значення, або за відсутності такого - останнє false, тобто true */

// 18
false && (false || true)  => false
/*  || має перший пріоритет і повертає перше true значення, або за відсутності такого - останнє false, тобто true
    && має другий пріоритет і повертає перше false, або за відсутності такого - останнє true значення, тобто false */

// 19
(+null == false) < 1 ** 5  =>  false
/* Спочатку дужки: +null => 0; Рівність 0 == false правдива => true
   Далі піднесення до степеня => 1 * 1 * 1 * 1 * 1 = 1 
   Далі порівняння true < 1 => 1 < 1 => false */
